
export const successMessage = {
    profile : {
        motivation : "자기소개서 지원동기가 성공적으로 업데이트 되었습니다.",
        growth : "자기소개서 성장과정이 성공적으로 업데이트 되었습니다.",
        goals : "자기소개서 포부가 성공적으로 업데이트 되었습니다.",
        adventage : "자기소개서 장단점이 성공적으로 업데이트 되었습니다.",
    },
    category : {
        post : "카테고리가 성공적으로 업데이트 되었습니다.",
        delete : '카테고리와 연관된 보드 및 블록이 성공적으로 삭제되었습니다.',
        put : '카테고리가 성공적으로 수정되었습니다.'
    },
    board : {
        get : '게시판이 성공적으로 로드되었습니다.',
        noBoard : '등록된 게시판이 없습니다.',
        post : '게시글이 성공적으로 추가되었습니다.',
        aleadyTitleEq : '제목이 이미 동일합니다.',
        patchTitle : "제목이 성공적으로 변경되었습니다.",
        delete : '게시글과 관련 블록이 성공적으로 삭제되었습니다.',
        search : '게시판이 성공적으로 로드되었습니다.',
        noSearch : '검색 결과가 없습니다.',
    },
    block : {
        post : '작성중인 문서가 저장되었습니다.',
    },
    folder : {
        get : '폴더 데이터를 성공적으로 로드하였습니다.',
        post : '폴더를 성공적으로 등록하였습니다.',
        delete : '성공적으로 삭제하였습니다.',
        noFile : "업로드된 파일이 없습니다.",
    },
    tree : {
        get : 'Tree가 성공적으로 로드되었습니다.',
        noTree : '등록된 Tree가 없습니다.',
    },
    purpose : {
        get : '목표가 성공적으로 로드되었습니다.',
        noPurpose : '등록된 목표가 없습니다.'
    },
    project : {
        get : '프로젝트가 성공적으로 로드되었습니다.',
        noProject : '등록된 프로젝트가 없습니다.',
    },
    snippet : {
        post : '스니펫이 성공적으로 등록되었습니다.',
        put : '스니펫이 성공적으로 수정되었습니다.',
        delete : '스니펫이 성공적으로 삭제되었습니다.',
    },
    timeline : {
        noTimeline : '등록된 타임라인이 없습니다.',
        get : '타임라인이 성공적으로 로드되었습니다.',
        post : '타임라인이 성공적으로 등록되었습니다.',
        delete : '타임라인이 성공적으로 삭제되었습니다.',
    }
}